target/test-classes/xml/selfcare/modifysubscription/TC31927_accept

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ord1:createOrder type="UPGRADE" correlationId="$correlationId$" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <account type="RESIDENTIAL" accountNumber="$accountNumber$"/>
            <verification runCreditCheck="false" termsAndConditionsAccepted="true" refundableDepositAccepted="false" acceptAgreement="true">
                <interconnect>
                    <param name="PAYASYOUGO"/>
                </interconnect>
            </verification>
            <orderDetail orderRef="12345" orderId="$orderId$" ipAddress="160.206.234.22" salesChannel="Care (CSA)" externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" paymentMethod="CARD" agentId="Carla" branchId="Branch001">
                <dateTime>2011-06-10T16:44:31.0Z</dateTime>
                <orderItem id="3" dealSKU="DEAL-INHAND">
                    <serviceRef reference="Mobile FC 3">$MPN$</serviceRef>
                    <tariff productCode="FC24-2000-500">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="HTC-DESIRE-XXX-99">
                        <deliveryMethod>DELIVER</deliveryMethod>
                        <imei>143219180932760</imei>
                        <serialNumber>123152436457768456784684</serialNumber>
                        <agreement provider="AGRTESCOMOBILE">
                            <number>43H1QuuZJ9</number>
                        </agreement>
                    </device>
                    <discBundle productCode="02000-SB-A" bundleGroup="SB-GRP-A" billCapNotifications="false">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <paymentRequest>
                    <cardName>Card</cardName>
                    <cardNumber>5105105105105100</cardNumber>
                    <cardType>MC</cardType>
                    <cardExpiryDate>0328</cardExpiryDate>
                    <cvv>111</cvv>
                </paymentRequest>
            </orderDetail>
        </ord1:createOrder>
    </soapenv:Body>
</soapenv:Envelope>
